IDEA Open Model
SectionResultOnPoints Class
Compatible with IDEA StatiCa v 10.1
 Section result of points
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.SectionResultOnPoints
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public class SectionResultOnPoints : SectionResultBase
Public Class SectionResultOnPoints
	Inherits SectionResultBase
public ref class SectionResultOnPoints : public SectionResultBase
The SectionResultOnPoints type exposes the following members.
Constructors
Name | Description
SectionResultOnPoints
 Constructor
Top
Properties
Name | Description
Loading
 Loading
 (Inherited from SectionResultBase.)
Points
 Section points
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace